final-project/simulationNonInertial/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (40 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (40 0 0);
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform (40 0 0);
    }
    rightSide
    {
        type            symmetryPlane;
    }
    leftSide
    {
        type            symmetryPlane;
    }
    duct
    {
        type            noSlip;
    }
    cylinder
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 1 0);
        omega           50;
    }
}

// ************************************************************************* //
