final-project/simulationNonInertial/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
    rightSide
    {
        type            symmetryPlane;
    }
    leftSide
    {
        type            symmetryPlane;
    }
    duct
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
    cylinder
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
